In [1]:
import sqlite3
import pandas as pd
from sqlite3 import connect

In [2]:
DB_PATH='D:\\과제 study\\bigdata\\sqlite_test.db'
with connect(DB_PATH) as db:
    db.execute("""
        CREATE TABLE IF NOT EXISTS Orders(
            order_id INT,
            item VARCHAR(40),
            amount INT,
            custom_id INT REFERENCES Customers(id),
            CONSTRAINT OrdersPK PRIMARY KEY (order_id)
        )
    """)
with connect(DB_PATH) as db:
    db.execute("""
        CREATE TABLE IF NOT EXISTS Customers(
            id INT,
            last_name VARCHAR(40),
            first_name VARCHAR(40),
            age INT,
            country VARCHAR(40),
            CONSTRAINT CustomersPK PRIMARY KEY (id)
               )
        """)

In [3]:
conn=sqlite3.connect(DB_PATH)
cursor=conn.cursor()
table=pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'",conn)
table=pd.read_sql_query("SELECT * FROM Customers",conn)
table.head()
table=pd.read_sql_query("SELECT * FROM Orders",conn)
table.head()

Empty DataFrame
Columns: [order_id, item, amount, custom_id]
Index: []

In [11]:
INSERT_SQL= 'INSERT INTO Orders(order_id, item, amount, custom_id) VALUES(?,?,?,?);'
data=(
    (1,'공책',500,5),
    (2,'펜',10,2),
    (3,'마커',120,3),
    (4,'책',1000,4),
    (5,'지우개',20,1)
    )
cursor.executemany(INSERT_SQL,data)
conn.commit()

In [12]:
cursor.execute('SELECT * FROM Orders')
item_list=cursor.fetchall()
for i in item_list:
    print(i)

(1, '공책', 500, 5)
(2, '펜', 10, 2)
(3, '마커', 120, 3)
(4, '책', 1000, 4)
(5, '지우개', 20, 1)

In [16]:
INSERT_SQL= 'INSERT INTO Customers(id,last_name,first_name,age,country) VALUES(?,?,?,?,?);'
data=(
    (1,'홍','길동',331,'한국'),
    (2,'Luna','Robert',10,'미국'),
    (3,'Kim','Monica',35,'러시아'),
    (4,'모리','나나세',59,'일본'),
    (5,'Doe','Betty',20,'영국')
    )
cursor.executemany(INSERT_SQL,data)
conn.commit()

In [20]:
q="""SELECT * FROM Orders WHERE custom_id = 3;"""
pd.read_sql_query(q,conn)

   order_id item  amount  custom_id
0         3   마커     120          3

In [21]:
q="""SELECT * FROM Customers WHERE id = 1;"""
pd.read_sql_query(q,conn)

   id last_name first_name  age country
0   1         홍         길동  331      한국

In [25]:
UPDATE_SQL='UPDATE Customers SET country="카자흐스탄" WHERE first_name="monica";'
cursor.execute(UPDATE_SQL)
conn.commit()

cursor.execute('SELECT * FROM Customers WHERE first_name="monica";')
updated_customers = cursor.fetchall()
print(updated_customers)

[]